Repository: Ihnore-Ihor/FurTable-Recipe-App
Catalog: lib/l10n/app_*.arb
Languages: uk

source: Log In
uk: Вхід

# signUp
source: Create Account
uk: Реєстрація

source: Welcome Back
uk: З поверненням

# fillInfo
source: Fill out the information below...
uk: Заповніть інформацію нижче...

source: Let's get started...
uk: Почнімо...

source: Email
uk: Ел. пошта

source: Password
uk: Пароль

source: Nickname
uk: Нікнейм

source: Sign In
uk: Увійти

source: Get Started
uk: Почати

source: OR
uk: АБО

source: Continue with Google
uk: Увійти через Google

# accountCreatedCheckEmail
source: Account created! Please check your email to verify.
uk: Акаунт створено! Перевірте пошту для підтвердження.

# invalidEmail
source: Please enter a valid email address
uk: Введіть коректну електронну пошту

# minPassword
source: Minimum 8 characters required
uk: Мінімум 8 символів

# mustContainNumber
source: Must contain at least one number
uk: Має містити хоча б одну цифру

# requiredField
source: Please fill in this field
uk: Це поле обов'язкове

source: Explore
uk: Головна

source: My Recipes
uk: Мої рецепти

source: Favorites
uk: Улюблене

source: Search
uk: Пошук

# cookTime
source: Cooking Time
uk: Час готування

source: Ingredients
uk: Інгредієнти

source: Instructions
uk: Інструкції

source: Description
uk: Опис

# byAuthor
source: by {name}
uk: від {name}

# noDescription
source: No description provided.
uk: Опис відсутній.

# noIngredients
source: No ingredients listed.
uk: Інгредієнти не вказані.

# noInstructions
source: No instructions listed.
uk: Інструкції не вказані.

# step
source: Step {number}
uk: Крок {number}

source: Create Recipe
uk: Створити рецепт

source: Edit Recipe
uk: Редагувати рецепт

source: Recipe Image
uk: Фото рецепту

source: Tap to add photo
uk: Натисніть, щоб додати фото

source: Recipe Title
uk: Назва рецепту

# enterTitle
source: Enter recipe title...
uk: Введіть назву...

# describeRecipe
source: Describe your recipe...
uk: Опишіть ваш рецепт...

# enterIngredientHint
source: Example: 2 Eggs 200g Flour (Each on a new line)
uk: Приклад: 2 Яйця 200г Борошна (Кожен з нового рядка)

# enterInstructionHint
source: Example: Mix eggs. Bake at 180C. (Each step on a new line)
uk: Приклад: Збити яйця. Запікати при 180C. (Кожен крок з нового рядка)

# makePublic
source: Make this recipe public
uk: Зробити публічним

# anyoneCanSee
source: Anyone can see this recipe
uk: Будь-хто зможе бачити цей рецепт

source: Select time
uk: Оберіть час

source: Compressing image...
uk: Стиснення зображення...

# recipeCreated
source: Recipe created successfully!
uk: Рецепт успішно створено!

source: Recipe updated!
uk: Рецепт оновлено!

source: Save
uk: Зберегти

source: Done
uk: Готово

source: Days
uk: Дн

source: Hours
uk: Год

source: Mins
uk: Хв

source: Profile
uk: Профіль

source: Edit Profile
uk: Редагувати профіль

source: Tap to change photo
uk: Натисніть для зміни фото

# chooseAvatar
source: Choose an Avatar
uk: Оберіть аватар

source: Account Settings
uk: Налаштування акаунту

source: FAQ
uk: Часті питання

source: Help & Support
uk: Допомога

source: Send Feedback
uk: Надіслати відгук

source: Log Out
uk: Вийти

source: Email not verified
uk: Пошта не підтверджена

# resendVerification
source: Resend Verification Email
uk: Надіслати лист повторно

# waitToResend
source: Wait {seconds}s to resend
uk: Зачекайте {seconds}с

# verificationSent
source: Verification email sent! Check your inbox.
uk: Лист надіслано! Перевірте вхідні.

source: Profile updated!
uk: Профіль оновлено!

# nicknameEmpty
source: Nickname cannot be empty
uk: Нікнейм не може бути пустим

# faqQ1
source: How do I create a recipe?
uk: Як створити рецепт?

# faqA1
source: Go to the 'My Recipes' tab (book icon) and tap the '+' icon in the top right corner.
uk: Перейдіть на вкладку 'Мої рецепти' (іконка книги) та натисніть '+' у верхньому куті.

# faqQ2
source: Can I make my recipes private?
uk: Чи можу я приховати рецепти?

# faqA2
source: Yes! When creating or editing a recipe, toggle the 'Make this recipe public' switch off.
uk: Так! При створенні або редагуванні вимкніть перемикач 'Зробити публічним'.

# faqQ3
source: How do I change my password?
uk: Як змінити пароль?

# faqA3
source: Navigate to Profile > Account Settings > Change Password.
uk: Профіль > Налаштування акаунту > Змінити пароль.

# faqQ4
source: Is FurTable free?
uk: FurTable безкоштовний?

# faqA4
source: Yes, FurTable is completely free to use for everyone.
uk: Так, FurTable повністю безкоштовний для всіх.

# faqQ5
source: How do I delete my account?
uk: Як видалити акаунт?

# faqA5
source: Go to Profile > Account Settings and select 'Delete Account' at the bottom.
uk: Профіль > Налаштування акаунту > Видалити акаунт.

# feedbackThanks
source: Thank you for your feedback!
uk: Дякуємо за ваш відгук!

# feedbackError
source: Error sending feedback: {error}
uk: Помилка: {error}

# tellUsExperience
source: Tell us about your experience...
uk: Розкажіть про ваші враження...

# feedbackHint
source: Share your thoughts, suggestions, or report any issues...
uk: Поділіться думками, ідеями або повідомте про проблему...

# emailIncluded
source: Your email address ({email}) will be included with this feedback.
uk: Вашу пошту ({email}) буде додано до відгуку.

source: In progress...
uk: В процесі...

# reachedEnd
source: You've reached the end
uk: Ви дійшли до кінця

# changePasswordSubtitle
source: Update your password for enhanced security.
uk: Оновіть пароль для підвищення безпеки.

# enterCurrentPassword
source: Enter your current password
uk: Введіть поточний пароль

# enterNewPassword
source: Enter your new password
uk: Введіть новий пароль

# confirmYourPassword
source: Confirm your new password
uk: Підтвердіть новий пароль

# passwordRequirement
source: Minimum 8 characters, including one number
uk: Мінімум 8 символів, включаючи одну цифру

# clearCacheDialogTitle
source: Clear Cache?
uk: Очистити кеш?

# clearCacheDialogDesc
source: This will remove all downloaded images. They will be re-downloaded when needed.
uk: Це видалить усі завантажені зображення. Вони будуть завантажені знову за потреби.

# clearCacheSuccess
source: Image cache cleared successfully
uk: Кеш зображень успішно очищено

source: Error clearing cache
uk: Помилка очищення кешу

source: Change Password
uk: Змінити пароль

source: Current Password
uk: Поточний пароль

source: New Password
uk: Новий пароль

source: Confirm New Password
uk: Підтвердити пароль

source: Passwords do not match
uk: Паролі не співпадають

source: Password updated!
uk: Пароль оновлено!

source: Storage & Cache
uk: Сховище та Кеш

# enableCaching
source: Enable Image Caching
uk: Увімкнути кешування

# saveImagesLocally
source: Save images locally for faster loading
uk: Зберігати фото локально для швидкості

# autoClear
source: Auto-clear on Startup
uk: Авто-очищення при старті

# clearCacheStart
source: Clear cache every time app starts
uk: Очищати кеш при кожному запуску

# clearCacheNow
source: Clear Image Cache Now
uk: Очистити кеш зараз

source: Delete Account
uk: Видалити акаунт

# deleteAccountConfirm
source: Delete Account?
uk: Видалити акаунт?

# deleteAccountDesc
source: Are you sure you want to permanently delete this account? This action cannot be undone.
uk: Ви впевнені? Цю дію неможливо скасувати.

source: Language
uk: Мова

source: Type to search...
uk: Введіть для пошуку...

source: No recipes found.
uk: Рецептів не знайдено.

# tryDifferentSearch
source: Try searching for something else.
uk: Спробуйте інший запит.

source: Recent Searches
uk: Історія пошуку

source: Clear
uk: Очистити

source: Error
uk: Помилка

source: Success
uk: Успішно

source: Cancel
uk: Скасувати

source: Delete
uk: Видалити

source: Edit
uk: Редагувати

source: Update
uk: Оновити

# deleteRecipeTitle
source: Delete Recipe?
uk: Видалити рецепт?

# deleteRecipeContent
source: Are you sure you want to permanently delete this recipe? This action cannot be undone.
uk: Ви впевнені, що хочете безповоротно видалити цей рецепт? Цю дію неможливо скасувати.

source: Recipe deleted
uk: Рецепт видалено

# searchHint
source: Recipe or Author
uk: Рецепт або Автор

source: Public
uk: Публічні

source: Private
uk: Приватні

source: No recipes yet
uk: Ще немає рецептів

# noFavorites
source: No favorites yet
uk: У вибраному пусто

# tapHeart
source: Tap the heart icon on recipes you love
uk: Тисніть на серце, щоб зберегти рецепт

# joinTitle
source: Join FurTable
uk: Приєднуйтесь до FurTable

# loginOrSignup
source: Log In / Sign Up
uk: Вхід / Реєстрація

# guestMyRecipesTitle
source: Start Cooking!
uk: Почніть готувати!

# guestMyRecipesMessage
source: Create an account to save your own recipes and share them with the world.
uk: Створіть акаунт, щоб зберігати власні рецепти та ділитися ними зі світом.

# guestFavoritesTitle
source: Save Your Favorites
uk: Зберігайте улюблене

# guestFavoritesMessage
source: Log in to create your personal collection of delicious recipes.
uk: Увійдіть, щоб створити власну колекцію смачних рецептів.

# authRequiredLike
source: Log in to add this recipe to your favorites.
uk: Увійдіть, щоб додати цей рецепт до улюблених.

# authRequiredAction
source: Log in to perform this action.
uk: Увійдіть, щоб виконати цю дію.
